--[[ 
▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀          
▀▄ ▄▀                                      ▀▄ ▄▀ 
▀▄ ▄▀    BY Th3_BOOS                   ▀▄ ▄▀ 
▀▄ ▄▀     BY Th3_BOOS (@Th3_BOOS)    ▀▄ ▄▀ 
▀▄ ▄▀ JUST WRITED BY Th3_BOOS          ▀▄ ▄▀   
▀▄ ▄▀          help1  : مساعدة             ▀▄ ▄▀ 
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀
--]]
do

local function run(msg, matches)
if is_momod(msg) and matches[1]== "مساعدة" then
return [[
🔱★ƊƐѶÏĻ™<⚜>ƁÕT★🔱
🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀
اهلا وسهلا في ديفل بوت 🌝🍃

النسخه العربية

اوامر البوت العربية 🌐💹
🔰🔰🔰🔰🔰🔰🔰🔰🔰🔰🔰🔰🔰

📜اوامر الطرد و الحضر 

🌐:: {دي} =طرد عضو
🌐:: {حظر} = حضر عضو
🌐:: {الغاء الحظر} =الغاء حضر العضو
🌐:: {حظر عام} = حضر العضو عام
🌐:: {الغاء العام} = الغاء حضر العام
🌐:: {قائمه العام} =عرض المحضورين عام
 🌐:: {صامت} = كتم عضو
 🌐:: {صامت} = الغاء الكتم
🌐:: {دعبلني} = خروج من المجموعه 
🔴🔛🔛🔛🔛🔛🔛🔛🔛🔛🔛🔛🔴
📜اوامر رفع وازاله ادمن
🌐:: {رفع مشرف} = لضافه مشرف 
🌐:: {المشرف} =اضهار المشرف
 🌐:: {رفع ادمن} = لضافه ادمن
 🌐:: {ازالة ادمن} = انزال ادمن 
🔵🔛🔛🔛🔛🔛🔛🔛🔛🔛🔛🔛🔵
📜اوامر المجموعه 

🌐:: {الاعدادات} = ضهور العدادات 
🌐:: {القوانين} الاضهار قوانين
🌐:: {وضع القوانين} = اضافه قوانين
🌐:: {الوصف} = اضهار الوصف 
🌐:: {وضع الوصف} = اضافه الوصف
 🌐:: {ايدي} = اضهار ايدي العضو
 🌐:: {وضع صورة} = وضع صوره للكروب
 🌐:: {وضع اسم} = وضع اسم للكروب
 🌐:: {وضع معرف} = وضع معرف للكروب
 🌐:: {الرابط} = لجلب الرابط
 🌐:: {تغيير الرابط} = صنع رابط جديد
  🌐:: {رابط خاص} = ارسال رابط خاص
🌐:: {موقعي} = ارسال مقعك في الكروب
 🌐:: {مسح} = لحذف رساله برد
 🌐:: {تاك} = لعمل تاك للعضاء
 🌐:: {انستا} = لجلب معلومات انستا
⚫️🔛🔛🔛🔛🔛🔛🔛🔛🔛🔛🔛⚫️
📜اوامر حمايه المجموعه 

🌐 اقفل | افتح الروابط
🌐 اقفل | افتح الصوت
🌐 اقفل | افتح الكلايش الطويلة
🌐 اقفل | افتح التكرار
🌐 اقفل | افتح الغة العربية
🌐 اقفل | افتح الاضافه
🌐 اقفل | افتح الملصقات
🌐 اقفل | افتح البوتات
🌐 اقفل | افتح جهات التصال 
🌐 اقفل | افتح التاك
🌐 اقفل | افتح توجيه
🌐 اقفل | افتح الصور
🌐 اقفل | افتح الفيديو
🌐 اقفل | افتح الصور المتحركة
🌐 اقفل | افتح الملفات 
🌐 اقفل | افتح المحادثة
🌐 اقفل | افتح الكل
⚪️🔛🔛🔛🔛🔛🔛🔛🔛🔛🔛🔛⚪️
بوت ممتاز من جميع النواحي 🌝🍷
#⃣محمي من التفليش 💯
#⃣سيرفر مدفوع مده لحيات
#تريد البوت راسل المطورين 🕵
==========================
#DEVBOT 
            
@ali_iraqi ❌
@h_iQ_d ❌
@sudad1996 ❌
@HISHAM_AL_MOKHLES ❌
⛔️⛔️⛔️⛔️⛔️⛔️⛔️⛔️⛔️⛔️⛔️

رابط كروب الدعم 👇🏿👇🏿
https://telegram.me/joinchat/DN1ndT7onnAJc_j2OTQn0w
]]
end

if not is_momod(msg) then
return "للمشرفين فقط 😎🖕🏿"
end

end
return {
description = "Help list", 
usage = "Help list",
patterns = {
"(مساعدة)"
},
run = run 
}
end
