do

function run (msg, matches)

local reply_id = msg ['id']
if matches[1]==  'help' and is_momod(msg) then
local omar = [[★🔱★ƊƐѶÏĻ™<⚜>ƁÕT★🔱★
🔷〰🔶〰🔷〰🔶〰🔷〰🔶〰🔷
اهــ💕ــلا وســ❤️ــلا 
اختر احد الاوامر لأرسال المساعدة ☑️
🔷〰🔶〰🔷〰🔶〰🔷〰🔶〰🔷
❎ اضهار اوامر الطرد و الحضر ✔️ 
✅ help1
🔷〰🔶〰🔷〰🔶〰🔷〰🔶〰🔷
❎ اضهار اوامر المشرفين والاداريين✔️
✅ help2
🔷〰🔶〰🔷〰🔶〰🔷〰🔶〰🔷
❎ اضهار اوامر أعدادات المجموعة 🔰
✅ help3
🔷〰🔶〰🔷〰🔶〰🔷〰🔶〰🔷
❎ اضهار اوامر حماية المجموعة 💯💯
✅ help4
🔷〰🔶〰🔷〰🔶〰🔷〰🔶〰🔷]]
reply_msg(reply_id, omar, ok_cb, false)
end
local reply_id = msg ['id']
if matches[1]== 'help' and not is_momod(msg) then
    local omar = 'للمشرفين فقط'
    reply_msg(reply_id, omar, ok_cb, false)
    end
local reply_id = msg ['id']
if matches[1]==  'help4' and is_momod(msg) then
local help4 = [[️★🔱★ƊƐѶÏĻ™<⚜>ƁÕT★🔱★
⚠️〰〰〰〰〰〰〰〰〰〰⚠️
💹»» #اوامر_حمايـة_المجموعـة💯💯
💠➖➖💠➖➖💠➖➖💠➖➖💠
🔰»»قفل وفتـح الڤيديو ✅
🌐»» #d vi
🌐»» #b vi
💠➖➖💠➖➖💠➖➖�
🔰»»قفل وفتـح الرد  ✅
🌐»» #d re
🌐»» #b re
💠➖➖💠➖➖💠➖➖💠�
🔰»» قفل وفتـح دردشـة المجموعـة ✅
🌐»» #d tx
🌐»» #b tx
💠➖➖💠➖➖💠➖➖💠
🔰»» قفل وفـتح الصوتيات❎
🌐»» #d au
🌐»» #b au
💠➖➖💠➖➖💠➖➖💠
🔰»» قفل وفتـح اضافـة الأعضاء✅
🌐»» #d mm
🌐»» #b mm
💠➖➖💠➖➖💠➖➖💠
🔰»» قفل وفتـح اعادة التوجيـه ❎
🌐»» #d fw
🌐»» #b fw
💠➖➖💠➖➖💠➖➖💠
🔰»» قفل وفتـح ارسال الملفات ❇️
🌐»» #d mf
🌐»» #b mf
💠➖➖💠➖➖💠➖➖💠
🔰»» قفل وفتـح الصور المتحركـة ❇️
🌐»» #d gf
🌐»» #b gf
💠➖➖💠➖➖💠➖➖💠
🔰»» قفل وفتح الملصـقات ❎ 
🌐»» #d st
🌐»» #b st
💠➖➖💠➖➖💠➖➖💠
🔰»» قفل و فتح الصور ️💹
🌐»» #d ph
🌐»» #b ph
💠➖➖💠➖➖💠➖➖💠
🔰»» قفل وفتح الروابط💹
🌐»» #d lk
🌐»» #b lk
💠➖➖💠➖➖💠➖➖💠
🔰»»قفل وفتـح التكرار وتحديد التكرار♍️
🌐»» #d ff
🌐»» #b ff
🌐»» #sff (عدد)
💠➖➖💠➖➖💠➖➖💠
🔰»»قفل وفتـح الرسائل الطويلـة♒️
🌐»» #d ss
🌐»» #b ss
💠➖➖💠➖➖💠➖➖💠
🔰»»قفل وفتـح اللغـة العربيـة💟
🌐»» #d aa
🌐»» #b aa
💠➖➖💠➖➖💠➖➖💠
🔰»»قفل وفَتـح الكُل 
🌐»»#d al
🌐»»#b al
 ➖▪️➖▫️➖🔸➖🔹➖🔺➖🔻
معـرف گر9ب الـدعم ✔️™ : 👇

                           https://telegram.me/joinchat/DN1ndT7onnAJc_j2OTQn0w

〰➰〰➰〰➰〰➰〰➰〰➰
#Dev :
@ali_iraqi  ❌
@sudad1996  ❌
@h_iQ_d  ❌
@alisama20 ❌
@HISHAM_AL_MOKHLES  ❌
◽️◾️◽️◾️◽️◾️◽️◾️◽️◾️◽️◾️]]
reply_msg(reply_id, help4, ok_cb, false)
end
local reply_id = msg ['id']
if matches[1]== 'help4' and not is_momod(msg) then
    local help = 'للمشرفين فقط'
    reply_msg(reply_id, help, ok_cb, false)
    end
local reply_id = msg ['id']
if matches[1]==  'help3' and is_momod(msg) then
local help3 = [[★🔱★ƊƐѶÏĻ™<⚜>ƁÕT★🔱★
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
💮>> اظهار القوانين 
🌐>> #ro
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
💮>> وضع قوانين 
🌐>> #sro
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
💮>> وضع صورة للمجموعة 
🌐>> #sph
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
💮>> وضع اسم للمجموعة 
🌐>> #snm
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
💮>> حذف رسائل بالعدد
🌐>> #del (عدد) 
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
💮>> اضهار ايديات الأعضاء 
🌐>> #who
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
💮>> اظهار ايدي عضو 
🌐>> #id {user} Reply
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
💮>> صنع رابط جديد 
🌐>> #nwlk
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
💮>> اضافه رابط 
🌐>> #slk
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
💮>> اظهار الرابط 
🌐>> #lk
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
💮>> أرسال الرابط الى الخاص 
🌐>> #linkpv
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
💮>> اظهار الطقس 
🌐>> #wea + المدينة 
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
💮>> اظهار موقعك في المجموعة 
🌐>> #me 
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
💮>> عمل تاگ للأعضاء
🌐>>/tagall + الرساله
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
💮>> اظهار الوقت 
🌐>> #time + مدينة
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
💮>> اوامر خاص 
🌐>> #help pv
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
💮>> عرض اوقات الصلاه
🌐>> #azan (المدينه)
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
❌❌ رابط كروب الدعم 🍃🍃👇

                         https://telegram.me/joinchat/DN1ndT7onnAJc_j2OTQn0w

⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
#DEVBOT 
@ali_iraqi ❌
@Alisama20 ❌
@h_iQ_d ❌
@sudad1996 ❌
@HISHAM_AL_MOKHLES ❌]]
reply_msg(reply_id, help3, ok_cb, false)
end

local reply_id = msg ['id']
if matches[1]==  'help5' and is_momod(msg) then
local help5 =[[]]
reply_msg(reply_id, help5, ok_cb, false)
end

local reply_id = msg ['id']
if matches[1]==  'help2' and is_momod(msg) then
local help2 = [[★🔱★ƊƐѶÏĻ™<⚜>ƁÕT★🔱★
★★★★★★★★★★★★★★★
✅>> رفع مشرف 
Ⓜ️>> #ow {user} [id] Reply
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️ 
❇️>> اضهار المشرف 
Ⓜ️>> #xow
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️ 
✅>> رفع ادمن
Ⓜ️>> #pp {user} [id] Reply
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️ 
❎>> ازاله ادمن 
Ⓜ️>> #qq {user} [id] Reply
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️ 
❇️>> اضهار الادمنيه 
Ⓜ️>> #xpp
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
🈯️>> وضع معرف للمجموعة 
Ⓜ️>> #suser + معرف 
⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
❌❌ رابط كروب الدعم 🍃🍃👇

                              https://telegram.me/joinchat/DN1ndT7onnAJc_j2OTQn0w

⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
#DEVBOT 
@ali_iraqi ❌
@Alisama20 ❌
@h_iQ_d ❌
@sudad1996 ❌
@HISHAM_AL_MOKHLES ❌]]
reply_msg(reply_id, help2, ok_cb, false)
end

local reply_id = msg ['id']
if matches[1]==  'help1' and is_momod(msg) then
local help1 = [[★🔱★ƊƐѶÏĻ™<⚜>ƁÕT★🔱★
⚠️〰〰〰〰〰〰〰〰〰〰〰⚠️
💹»» #اوامر_الطرد_الحضر

🌐»» #de {user} [id] Reply

🔰»»طرد عضو من المجموعة ✅
💠➖➖💠➖➖💠➖➖💠➖➖💠 
🌐»» #bn {user} [id] Reply

🔰»» حضر عضو من المجموعة ✅
💠➖➖💠➖➖💠➖➖💠➖➖💠
🌐»» #ubn {user} [id] Reply

🔰»» الغاء الحضر عن العضو ❎
💠➖➖💠➖➖💠➖➖💠➖➖💠
🌐»» #bnal {user} [id] Reply

🔰»» عضر عضو عام ✅
💠➖➖💠➖➖💠➖➖💠➖➖💠
🌐»» #ubnal {user} [id] Reply
 
🔰»» الغاء حضر العام عن العضو ❎
💠➖➖💠➖➖💠➖➖💠➖➖💠
🌐»» #sbn {user} [id] Reply

🔰»» قائمة المحضورين ❇️
💠➖➖💠➖➖💠➖➖💠➖➖💠
🌐»» #sil {user} [id] Reply

🔰»»كتم عضو ❇️
💠➖➖💠➖➖💠➖➖💠➖➖💠
🌐»» #sil {user} [id] Reply

🔰»» الغاء كتم العضو ❎
💠➖➖💠➖➖💠➖➖💠➖➖💠
🌐»» #silnt

🔰»» قائمة المكتومين 🈯️
💠➖➖💠➖➖💠➖➖💠➖➖💠
🌐»» #kkme

🔰»» للخروج من المجموعة 💹
💠➖➖💠➖➖💠➖➖💠➖➖💠
❌❌ معرف كروب الدعم 🍃🍃👇

                 https://telegram.me/joinchat/DN1ndT7onnAJc_j2OTQn0w

⚠️〰➰〰➰〰➰〰➰〰➰〰⚠️
#DEVBOT 
@ali_iraqi ❌
@Alisama20 ❌
@h_iQ_d ❌
@sudad1996 ❌
@HISHAM_AL_MOKHLES ❌]]
reply_msg(reply_id, help1, ok_cb, false)
end
end
return {
patterns = {
"^(help)$",
"^(help4)$",
"^(help3)$",
"^(help5)$",
"^(help2)$",
"^(help1)$",
},
run = run
}
end