-- made by { @Mouamle }
do
	ws = {}
	rs = {}
	
-- some examples of how to use this :3 
ws[1] = "فديتك" -- msg 
rs[1] = "مح اعشقك " -- reply

ws[2] = "شلونك" -- msg
rs[2] = "تمام بحي وانتة " -- reply

ws[3] = "تمام" -- msg
rs[3] = "دووم" -- reply


ws[4] = "ضوجة" -- msg 
rs[4] = "اي خرب وين نروح" -- reply

ws[5] = "اوف" -- msg 
rs[5] = "امشي خلي نروح للديسكو" -- reply

ws[6] = "يلة" -- msg 
rs[6] = "اصبر خل البس الحذاء هههه" -- reply

ws[8] = "احبج" -- msg 
rs[8] = "خاف اكلك/ج احبك وتالي تخوني🤔☹️" -- reply

ws[9] = "احبك" -- msg 
rs[9] = "خاف اكلك/ج احبك/ج وتالي تعوفني🤔😢" -- reply

ws[10] = "وينكم" -- msg
rs[10] = "هياتني بحي" -- reply

ws[11] = "اكل خرة" -- msg
rs[11] = "شنو هذا الخرة اللي يتطافر بحلكك/ج باباتي ؟؟  " -- reply

ws[12] = "اكلك" -- msg 
rs[12] = "كول" -- reply

ws[13] = "بوس الاعضاء" -- msg 
rs[13] = "لا ونعال الحمزة استحي" -- reply

ws[14] = "شكو ماكو" -- msg 
rs[14] = "غيرك براسي ماكو 💨😽🚬️" -- reply

ws[20] = "تا حسك اجذب" -- msg 
rs[20] = "شايفني كواد 🌚😂️" -- reply

ws[25] = "شنو رائيك" -- msg 
rs[25] = "بمنو️" -- reply

ws[26] = "كلخرا" -- msg
rs[26] = "قدم/ي نفسك/ج بماعون فرفوري لو سمحت/ي   " -- reply

ws[27] = "نجب" -- msg
rs[27] = "شكد عديم/ة ذووق لعد  " -- reply

ws[28] = "مرحبا" -- msg 
rs[28] = "مراحب 🌹 منور/ة 😊️" -- reply

ws[29] = "هلو" -- msg 
rs[29] = "هلوات 🌹 منور/ة 😊️" -- reply

ws[30] = "السلام عليكم" -- msg 
rs[30] = "وعليكم 👋🏿 السلام ورحمة الله 😊🌹" -- reply

ws[36] = "باي" -- msg 
rs[36] = "بايات 👋🏿 الله وياك/ج وردة 😊🌹" -- reply

ws[37] = "تا حسك ساحف" -- msg 
rs[37] = "اي والله 😁 اسحف علة ابوية اريد فلوس 🐼💔" -- reply

ws[38] = "تسلم" -- msg 
rs[38] = "ادلل حبي 😘🌹" -- reply

ws[39] = "شكد" -- msg 
rs[39] = "اكثر مما تصور 🙊❤️" -- reply

ws[41] = "اغير جو" -- msg 
rs[41] = "😂 تغير جو لو تسحف 🐍 عل بنات" -- reply

ws[42] = "ههه" --msg
rs[42] = " دوووووم 😇🌸" --reply

ws[43] = "تحبني" -- msg
rs[43] = "لا اعشقك فقط" -- reply

ws[44] = "شخباركم" -- msg 
rs[44] = "والله عايشين وانتو شخباركم" -- reply

ws[45] = "بوسني" -- msg
rs[45] = "ممممممممح" -- reply

ws[46] = "تعاي خاص" -- msg
rs[46] = "اشتغل الزحف شد بوية شد ههه" -- reply

ws[47] = "انجب" -- msg
rs[47] = "ليش مو د احمي اكروبك 😞💔" -- reply

ws[48] = "تعاي خاص" -- msg
rs[48] = "اشتغل الزحف شد بوية شد ههه" -- reply

ws[49] = "عرفنه" -- msg
rs[49] = "اقدملك نفسي بوت ديفل بعد اكثر من هاذ ما نطيك خاف ع جنسيتي" -- reply

ws[50] = "وجع" -- msg
rs[50] = "بكلبك/ج" -- reply

ws[51] = "دولي" -- msg 
rs[51] = "لا محلي احسن دي" -- reply

ws[52] = "نايمين" -- msg
rs[52] = "يي مهجوعين واني هنا اتانيهم" -- reply

ws[53] = "اموت عليك" -- msg
rs[53] = "ما صدك شو بالله نطيني بوسة" -- reply

ws[54] = "اعشقك" -- msg
rs[54] = "واني اتنفس هواك/ج🙊❤️" -- reply

ws[55] = "غبي" -- msg 
rs[55] = "هو اللي يشوفكم موزين يبقى براسة عقل" -- reply

ws[56] = "مساء الخير" -- msg
rs[56] = "مساء الخيرات" -- reply 

ws[57] = "مساء النور" -- msg 
rs[57] = "مساء الانوار" -- reply

ws[58] = "سلخير" -- msg
rs[58] = "سلنور" -- reply

ws[59] = "سمعليكو" -- msg
rs[59] = "وعليكم" -- reply

ws[60] = "اشكرك" -- msg
rs[60] = "لا شكر على واجب" -- reply

ws[61] = "ملل" -- msg
rs[61] = "كلنا هيج نركص مثلاً؟😫🌱" -- reply

ws[62] = "فدوه" -- msg
rs[62] = "فدوه لخشمك/ج" -- reply 

ws[63] = "امشي نروح" -- msg
rs[63] = "اخذوني وياكم لو محد يروح" -- reply

ws[64] = "اكولج" -- msg 
rs[64] = "كوليللهة واني هم اريد اسمع🙊❤️" -- reply

ws[65] = "علوش كفشاوي" -- msg
rs[65] = "يمه الحب يمه🙊❤️" -- reply

ws[66] = "نمشي" -- msg
rs[66] = "شنو هاي بابا🌝شعدنة ممشى هنا" -- reply 

ws[67] = "😒" -- msg
rs[67] = "عدل/ي   خلقتك/ج  تطرد العافية من امه محمد 💦😗" -- reply

ws[68] = "حبيبي" -- msg
rs[68] = "هااا يا عمر عمري" -- reply

ws[69] = "تف" -- msg
rs[69] = "جيب/ي وصله وتعال/ي مسح الشاشه ترستهاا تفال "

ws[70] = "رؤى" -- msg
rs[70] = "وحده حبابه فدوه لكلبهاا " -- reply

ws[71] = "امداك" -- msg
rs[71] = "ليش شمسويلك اني امداك انته" -- reply

ws[72] = "😹" -- msg
rs[72] = "دوووووم الضحكة ضلع/ة😹" -- reply

ws[73] = "🌚" -- msg
rs[73] = "مضلم/ة صخام الجدر 🌚✋🏽" -- reply

ws[74] = "😘" -- msg
rs[74] = "لك لا تبوس ونعال الحمزه استحي 🙊🐸" -- reply

ws[75] = "😪" -- msg
rs[75] = "ولك/ج مسح خشمك/ج فشلتوونه ولله 😪👌🏿" -- reply

ws[76] = "💋" -- msg
rs[76] = "هلا هلا صارت بيها بوس 😟😟" -- reply

ws[77] = "😢" -- msg
rs[77] = "خطية كام يبجي منو لي ماخذ #ننه 🍼 من حلك/ها 😹💦" -- reply

ws[78] = "☹️" -- msg
rs[78] = "فدوه لشنوفتك/ج 😹🐳" -- reply

ws[79] = "😂😂😂" -- msg
rs[79] = "دووووووم ضلع/ة 🌚❤️" -- reply

ws[80] = "خرب" -- msg
rs[80] = "حرام لا تكفر 👳🏿" -- reply

ws[81] = "انام" -- msg
rs[81] = "نومه بلا كعده ضلعي فديتك" -- reply

ws[82] = "رايح" -- msg
rs[82] = "روحة بلا ردة " -- reply

ws[83] = "اكتلك" -- msg
rs[83] = "ما تخوف جلبي" -- reply

ws[84] = "شكو" -- msg
rs[84] = "د يوزعون مركة قيمه بلكروب" -- reply

ws[85] = "صدك" -- msg
rs[85] = "وروحه لابويه لي ما احلف بي ابد لين ما اثق بي " -- reply

ws[86] = "😔" -- msg
rs[86] = "اووف كسرتـ/ي قلبـي😣رح اسويلكـ/چ مميـة وترجع/ـين توب گلـوب😇😁" -- reply 

ws[87] = "اصلي" -- msg
rs[87] = "فديت الايمان يا ماتحت السواهي دواهي" -- reply

ws[88] = "تخليني" -- msg
rs[88] = "بس اني بالاول"-- reply

ws[89] = "انته منو" -- msg
rs[89] = "انه سعد الحلي (ابو خالد دير بالك مني" -- reply

ws[90] = "وين" -- msg
rs[90] = "راح الم هدومي وارجع لبيتي طفح الكيل يا قريش " -- reply

ws[91] = "شوية واجي" -- msg
rs[91] = "نضف سنونك وتعال ابو جيفة🌝🖕🏾" -- reply

ws[92] ="انته تحب منو" -- msg
rs[92] ="@ali_iraqi" -- reply

ws[93] = "هونر" -- msg
rs[93] = "❤️عسل الكروب 😍ومحبوب الجماهير😘 بئ❤️" -- reply

ws[94] = "لوله" -- msg
rs[94] = "هاي وردة كروب امح😘💋🌹" -- reply

ws[95] = "هيبه" -- msg
rs[95] = "سكر البنات ووردة القناة💋🌺" -- reply

ws[96] = "مطي" -- msg
rs[96] = "ها زمال" -- reply

ws[97] = "😕" -- msg
rs[97] = "اووو عود صاير ثكيل وهوه ملطلط" -- reply

ws[98] = "بوت" -- msg
rs[98] = "وجع شتريد" -- reply

ws[99] = "عسولة" -- msg
rs[99] = "حلوة وامورة🙊وتخبل ومو مغرورة🙊😘" -- msg

ws[100] = "هاا" -- msg
rs[100] = "وجعاا😆" -- reply

ws[101] = "اكرهك" -- msg
rs[101] = "عساع انه لي احبك/ج تهي بهي وكت 😏😏" -- reply

ws[102] = "شبيك" -- msg
rs[102] = "العظاء يغلطون علي 😔💔" -- reply

ws[103] = "المطور" -- msg
rs[103] = "@devil_a_bot"  -- reply

ws[104] = "🍷🌝" -- msg
rs[104] = "نورت بعد روحي 🌝❤️" -- reply

ws[105] = "شكرا" -- msg
rs[105] = "ولوو تدلل/ي" -- reply

ws[106] = "وين المدير" -- msg
rs[106] = "جاي يكبل ويه الادمونات 😹💔" -- reply

ws[107] = "شسمك" -- msg
rs[107] = "ديفل" -- reply

ws[108] = "شكد عمرك" -- msg
rs[108] = "سنتين بعده حديث لولادة😹😹" -- reply

ws[109] = "ولك" -- msg
rs[109] = "ولكلاكة تلكلكك/ج" -- reply

ws[110] = "افلش" -- msg
rs[110] = "دي زباله تفلش وانه موجود" -- reply

ws[111] = "علي" -- msg
rs[111] = "عيوني" -- reply

ws[112] = "علوش" -- msg
rs[112] = "عيوني" -- reply

ws[113] = "زهراء" -- msg
rs[113] = "حبابة وتخبل🙊وثكيلة وماتكبل🙈🚶🏿" -- reply

ws[114] = "اني منو" -- msg
rs[114] = "انتة الغالي مالتي فطيتك🙊�" -- reply

ws[115] = "كرار" --msg
rs[115] = "هذا حبيبي شتريد منة" --reply

ws[116] = "منار" --msg
rs[116] = "شتريد منهة هاية لمدللة" --reply

ws[117] = "بساره" --msg
rs[117] = "ضلعة ماتي" --reply

ws[118] = "نوشه" --msg
rs[118] = "حبابه ورده ..تحب لوله هواي مشكله جنه صخله " --reply

ws[119] = "حبي" -- msg
rs[119] = "حبتك حيه انشالله  " --reply

ws[120] = "هشيم" -- msg 
rs[120] = "صكارك/ج هاذ️" -- reply 

ws[121] = "هشومتي" -- msg
rs[121] = "يا بعد روحيي ❤" -- reply

ws[122] = "ببوشه" -- msg
rs[122] = "🌹😍😍هاي صاكة كروب امممممححححح😘😘🌹" -- reply

ws[123] = "ديفلل" -- msg
rs[123] = "🌹😍�هااا يروح ديفل😘😘🌹" -- reply

ws[124] = "يلا" -- msg
rs[124] = "شنوو�" -- reply

ws[125] = "ضحى" -- msg
rs[125] = "😂تحب تضحك هواي دمه خفيف .بسرعه تهضم " -- reply

ws[126] = "حبيبك ايش" -- msg
rs[126] = "مايدوم" -- reply

ws[127] = "اسف" -- msg
rs[127] = "انت/ي شبقيت/ي" -- reply

ws[128] = "30" -- msg
rs[128] = "نجب ادب سز" -- reply

ws[129] = "عبودي" -- msg
rs[129] = "لتزحفلة " -- reply

ws[130]= "انت شعليك" -- msg
rs[130] = "هذا لنفس مل اني" -- reply

ws[131] = "الله يديم المحبة" -- msg
rs[131] = "لتلزك روح" -- reply

ws[132] = "اوك باي" -- msg
rs[132] = "زاحف امداك" -- reply

ws[133] = "يلاا حبي ديفل اني حروح" -- msg
rs[133] = "لالالا لتخلو يتركني" -- reply

ws[134] = "لتزحف" -- msg
rs[134] = "اني ما ازحف لناس تزحف عليه" -- reply

ws[135] = "ليش" -- msg
rs[135] = "حرام  انت متخاف من الله " -- reply

ws[136] = "ديفل ودع لولد" -- msg
rs[136] = "باااي حبيبيy" -- reply

ws[137] = "ليش يغلطون عليك" -- msg
rs[137] = "ان لم تجد اناس حاقدين عليك فاعلم انك انسان فاشل😌"  -- reply

ws[138] = "زركه" -- msg
rs[138] = "هاي @Rody97" -- reply

ws[139] = "🤔" -- msg
rs[139] = "صفنه مو الك/ج زمال/ه🤐📜" -- reply

ws[140] = "والله" -- msg
rs[140] = "الله لا شافك/ج" -- reply

ws[141] = "عينك" -- msg
rs[141] = "على صاحبك" -- reply

ws[142] = "اي" -- msg
rs[142] = "وجعي🙊💋" -- reply

ws[143] = "شعليك" -- msg
rs[143] = "فانطاستك ادبسزز" -- reply

ws[144] = "عبالي" -- msg
rs[144] = "عبالي لو عبيتله" -- reply

ws[145] = "🙊" -- msg
rs[145] = "ها قرد/ه شبيك/ج لاصم/ه حلكك/ج" -- reply

ws[146] = "😍" -- msg
rs[146] = "ستحي شوي ارعن" -- reply

ws[147] = "😎" -- msg
rs[147] = "انجب زمال عود هوه شخصيه" -- reply

ws[148] = "😌" --msg
rs[148] = "ها مطي ليش تتكبر " -- reply

ws[149] = "😳" -- msg
rs[149] = "جني كدام/ج  عيونك/ج ح يطكن" -- reply

ws[150] = "😡" -- msg
rs[150] = "اووي عصبت/ي موو " --reply

ws[151] = "🙃" -- msg
rs[151] = "لا ولخلقه " -- reply

ws[152] = "ديفل" -- msg
rs[152] = "عــ👀ــيونة وســنونة 😻💚" -- reply 

ws[153] = "غفو" -- msg
rs[153] = "يـا حلاة اسمـچ يروحـي😻 يسـوي للمشلـول واهـس ع المشـي🚶🏿❤️😻" -- reply

ws[154] = "احم" -- msg
rs[154] = " خخخخخــــ😤.💧ــــ💨ــــــ💦ـــتــــ💦ــــــفــــ♈️ــــووووو♈️خـتٓٓــ💧ـــِِفٍّ ًتٓٓــ💧ـــِِفٍّ " -- reply

ws[155] = "هشام" -- msg
rs[155] = "صاك - حات - حليو فديت ربه لو بس يكبل وياي (:"

ws[156] = "رنوش" -- msg
rs[156] = "هـاي☝️🏼️النبـض❣ماتي😻✋🏾" -- reply

ws[157] = "🤔." -- msg
rs[157] = "عود ليش دتحط نقطة عبالك تفلت مني ومن رزالتي !! يا فيلسوف!" -- reply

ws[158] = "Hi" -- msg
rs[158] = "HELLO" -- reply

ws[159] = "🌝" -- msg
rs[159] = "بـنٍَور🌝" -- reply

ws[160] = "دي" -- msg
rs[160] = "علـى ظهـرک🌝🖕🏿" -- reply

ws[161] = "كوم بي" -- msg
rs[161] = "بـا گوم بيک🤖" -- reply

ws[162] = "تعاي خاص" -- msg
rs[162] = "لا يـا زاحف يا بنحـرف😪🖕🏿" -- reply

ws[163] = "تعالي خاص" -- msg
rs[163] = "گبـر 😪زاحف" -- reply

ws[164] = "🍃🌝" -- msg
rs[164] = "بنـور الحديقـة🌝🚶🏾" -- reply

ws[165] = "عزة😱" -- msg
rs[165] = "يـا الله بلكي اكو تشريب😳😍" -- reply

ws[166] = "راح اموت😭" -- msg
rs[166] = "موتـة الچلب🌝💦" -- reply

ws[167] = "متت خوف" -- msg
rs[167] = "بعدک/ـچ ماشفت/ـي شي😪👌🏿" -- reply

ws[168] = "لخاطرك" -- msg
rs[168] = "طيط #بحي🌝🖕🏿" -- reply

ws[169] = "لخاطري" -- msg
rs[169] = "زربـة بخاطرک🌚😂" -- reply

ws[170] = "😒😒" -- msg
rs[170] = "تعدل خلقتـک لو بنعال🌝👍🏾" -- reply

ws[171] = "نعال بحلكك" -- msg
rs[171] = "آسـف موجوعان هسه رح اضمک لليل😪🖕🏿" -- reply

ws[172] = "النعال بحلكك" -- msg
rs[172] = "ما اشتهيک هسه🌝🖐🏼" -- reply

ws[173] = "دي🌝" -- msg
rs[173] = "علـى ظهرک🤖🖕🏿" -- reply

ws[174] = "بنت" -- msg
rs[174] = "والطـگعـة🌚🖐🏼" -- reply

ws[175] = "اني بنت" -- msg
rs[175] = "ـدي🖕🏿والطـگعـة😪" -- reply

ws[176] = "جذاب" -- msg
rs[176] = "بثلـک😪🖕🏿" -- reply

ws[177] = "راقب" -- msg
rs[177] = "نعالات بحلگـک احسن😪🖕🏿" -- reply

ws[178] = "ديفل يوكف هواي" -- msg
rs[178] = "والله بكيفـي😪الماعاجبـة يطگ راسة بنعـال����🖕🏿" -- reply

ws[179] = "ديفل واكف" -- msg
rs[179] = "كُل زَق يالحبيب😪👌🏿" -- reply

ws[180] = "البوت واكف" -- msg
rs[180] = "ببكـن تنچب☹️🖕🏿" -- reply

ws[181] = "وكف😐" -- msg
rs[181] = "گَعـدة💔🚶🏾" -- reply

ws[182] = "دز بصمه" -- msg
rs[182] = "تريد تخرعنـة بهالليل👷🌝" -- reply

ws[183] = "كس خواتكم" -- msg
rs[183] = "انظـف من كس اختک🌚🖕🏿" -- reply

ws[184] = "كس امك" -- msg
rs[184] = "ـد🖕🏿ـي ابن المهورة🌝" -- reply

ws[185] = "كسختك" -- msg
rs[185] = " مـا بي لوْلـة🌝 امگ تگعد ع الفلفـولة🌚🖕🏿" -- reply

ws[186] = "راقب كروبك" -- msg
rs[186] = "ـد>🐎<ـي🌝" -- reply

ws[187] = "هيمو" -- msg
rs[187] = "يـعـنـي لـغـالـي 😍مـل آٌنـّ'ℳέ'ـّيًٌ 😍🙈 يعني لنبض مل آٌنـّ'ℳέ'ـّيًٌ  ❤️️"--reply

ws[188] = "مودة" -- msg
rs[188] = "صاكة وفطيرة " -- reply

ws[189] = "سلفستر" -- msg
rs[189] = "حات مجلوب" -- reply

ws[190] = "شويه واجي" -- msg
rs[190] = "نضف سنونك وتعال ابو جيفة🌝🖕🏾" -- reply

ws[191] = "اقرالي دعاء" -- msg
rs[191] = "اللهم عذب المدرسين 😢 منهم الاحياء والاموات 😭🔥 اللهم عذب ام الانكليزي 😭💔 وكهربها بلتيار الرئيسي 😇 اللهم عذب ام الرياضيات وحولها الى غساله بطانيات 🙊 اللهم عذب ام الاسلاميه واجعلها بائعة الشاميه 😭🍃 اللهم عذب ام العربي وحولها الى بائعه البلبي اللهم عذب ام الجغرافيه واجعلها كلدجاجه الحافية اللهم عذب ام التاريخ وزحلقها بقشره من البطيخ وارسلها الى المريخ اللهم عذب ام الاحياء واجعلها كل مومياء اللهم عذب المعاون اقتله بلمدرسه بها" -- reply

ws[192] = "حسام" -- msg
rs[192] = "خبل؟زاحف نوعيه فاخره يحب الحمص" -- reply

ws[193] = "ديفل نطيهة فون" -- msg
rs[193] = "ليش حبي ليش هو اني عسكري وطايح حظي راتبي يروح ع الملاهي كله .. منين اجيبلهة" -- reply

ws[194] = "فنو" -- msg
rs[194] = "وردة❣حلـيوة❣تخبـُل😻شمـعتنـا😻💙والميعجـبـة يطـگ راسـة بحايطـنـا😉🖐🏽" -- reply

ws[195] = "شهد" -- msg
rs[195] = "اشهـد والشهـادة حِمـل 😻 مايلـوگ الجمـال إلا لخـدودج😻💋❣" -- reply

ws[196] = "بنو" -- msg
rs[196] = "وشحلاتـچ 😻 صوغَـة العافيـة مختومـة بأيديـچ😻 يا ربـوع الطيـب يـا جنـة الديـرة😻🌺❣"

ws[197] = "سروش" -- msg
rs[197] = "سَبـت هالـوادم بصيـت الجمـال البيهـة😻كحيلـة .. شهلاء .. وتلوگ الـرقـة اعلـى طاريهـة😻❤️" -- reply

ws[198] = "😞" -- msg
rs[198] ="كان يامكان لم يعد هيمو كما كان" -- reply

ws[199] = "ديفل موجود" -- msg
rs[199] = " لا طالع يسرح بالغنم المغرب يرجع" -- reply

ws[200] = "ديفلي" -- msg
rs[200] = "هلا قلبي وشراييني 🌝💙" -- reply

ws[201] = "فوشة تحبك" -- msg
rs[201] = "سوبهان الله شعور بتبادل 🌝🐾" -- reply

ws[202] = "يعني انته هم تحبهة؟" -- msg
rs[202] = "حيل تعلقت بيها 🌝 بس با كدر اسحفلها لأن تروح الهيبة وكذا 🌝💚" -- reply

ws[203] = "بوسهة" -- msg
rs[203] = "ممممممححيية   ع المكان اللي يعجبهة 🌝💋 بن حلقي اللذيذ🌝💜" -- reply

ws[204] = "مروان" -- msg
rs[204] = "الحَـات مالتنـة 😌 فـدفُد  لگلبـه 😻💋" -- reply

ws[205] = "الخال رامز" -- msg
rs[205] = "صكار الشماتة حامي عراضكم الذيب فديت الله ماله" -- reply

ws[206] = "منو مرتك" -- msg
rs[206] = "فــ😻ــنــ🌸ــو " -- reply

ws[207] = "عنوديه" -- msg 
rs[207] = "هايه حبيبتي احبهة كوولش واتحدة واحد بالبشر مثلي يحبهة😻 #المتكلم_سام " -- reply

ws[208] = "مشاكسه" --msg
rs[208] = "عنيده🙊ومحبوبه 🙈 وخبيثه 😻ومتواضعه 🐰🌝" -- reply

ws[209] = "جاو" -- msg
rs[209] = "كلعة (:" -- reply

ws[210] = "ججاو" -- msg
rs[210] = "كلعتين  {: " -- reply

ws[211] = "يلا جاو" -- msg
rs[211] = "الف تالاف كلعة *_* " -- reply

ws[212] = "يلا ججاو" -- msg
rs[212] = "عساكك لا رديت #*_* " -- reply

ws[213] = "ومرض" -- msg
rs[213] = "الي يصيبك -_-" -- reply

ws[214] = "برب" -- msg
rs[214] = "تيت {: " -- reply

ws[215] = "هشومي" -- msg
rs[215] = "يا بعد كلبي ❤️" -- reply

ws[216] = "هيشو" -- msg
rs[216] = "هلا ضلع ❤️" -- reply

ws[217] = "شوشتي" -- msg
rs[217] = "يا عيوني 🙈️" -- reply

ws[218] = "@hisham_al_mokhles" -- msg
rs[218] = "كول انة اكلة 🌝🍷️" -- reply

ws[219] = "ابو شوش" -- msg
rs[219] = "يروحلة فدوة ابو شهاب 🙊❤️️" -- reply

ws[220] = "hisham_al_mokhles" -- msg
rs[220] = "شنو تريد 🌝🍷️" -- reply

ws[221] = "hisham al mokhles" -- msg
rs[221] = "كول بطي 🌝🍷️" -- reply

ws[222] = "منو الحلو" -- msg
rs[222] = "المنصوري 😍️" -- reply

ws[223] = "المنصوري" -- msg
rs[223] = "تاج راسك/ج هاذ 💦🌚️" -- reply

ws[224] = "ها حبي" -- msg
rs[224] = "انجب لوكي 💦🌚️" -- reply

ws[225] = "ها حبيبي" -- msg
rs[225] = "انجب لوكي 💦🌚️" -- reply

ws[226] = "تعال" -- msg
rs[226] = "تعال ابو الاصبع 😹😹️" -- reply

ws[227] = "منو" -- msg
rs[227] = "خالتك /ج الشكرة 😹😹️" -- reply

ws[228] = "شلونكم" -- msg
rs[228] = "نفس لونكم 😹😹️" -- reply

ws[229] = "رهف" --msg
rs[229] = "صاكة الكروب الي يزحف اكسر رجليه" -- reply

ws[230] = "منو حبيب ديفل" --msg
rs[230] = "هيشو 🙊❤️" -- reply

ws[231] = "🙄" --msg
rs[231] = "افكس عيونك فاهي 😼️" -- reply

ws[232] = "ها حب" --msg
rs[232] = "هلا لوكي️" -- reply

ws[233] = "سافل" --msg
rs[233] = "ساقط 😼️" -- reply

ws[234] = "منيوك" --msg
rs[234] = "ابو العيورة 😹️" -- reply

ws[235] = "جاهل" --msg
rs[235] = "زعطوط 😼�️" -- reply

ws[236] = "ساقط" --msg
rs[236] = "سافل 😹" -- reply

ws[237] = "حيوان" --msg
rs[237] = "و لا حشرة مثلك 😹" -- reply

ws[238] = "زمال" --msg
rs[238] = "ما يعرف الزمال الا زمال مثلة 😹" -- reply

ws[239] = "📿🌚" --msg
rs[239] = "هلا مولاي 🌚" -- reply

ws[240] = "🌚📿" --msg
rs[240] = "تحياتي مولاي 🌚" -- reply

ws[241] = "#leave" --msg
rs[241] = "حاضر تم الخروج من المجموعة 🙂✨" -- reply

ws[242] = "#de" --msg
rs[242] = "رفستة من المجموعة 😹💔" -- reply

ws[243] = "/leave" -- msg
rs[243] = "حاضر .. يلا جاو اني طالع .. اخذو راحتكم محد يصكركم بعد  😹💔" -- reply

ws[245] = "ديفل اركص" -- msg 
rs[245] = "تعال/ي خاص اركصلك/ج ..ركبه جتف خصر للصبح" -- reply

-- the main function
function run( msg, matches )
	-- just a local variables that i used in my algorithm  
	local i = 0; local w = false

	-- the main part that get the message that the user send and check if it equals to one of the words in the ws table :)
	-- this section loops through all the words table and assign { k } to the word index and { v } to  word itself 
	for k,v in pairs(ws) do
		-- change the message text to uppercase and the { v } value that toke form the { ws } table and than compare it in a specific pattern 
		if ( string.find(string.upper(msg.text), "^" .. string.upper(v) .. "$") ) then
			-- assign the { i } to the index of the reply and the { w } to true ( we will use it later )
			i = k; w = true;
		end
	end

	-- check if { w } is not false and { i } not equals to 0
	if ( (w ~= false) and (i ~= 0) ) then
		-- get the receiver :3 
		R = get_receiver(msg)
		-- send him the proper message from the index that { i } assigned to
		--send_large_msg ( R , rs[i] );
		--send_reply(msg.id, rs[i])
		reply_msg(msg.id, rs[i], ok_cb, false )
	end
	
	-- don't edit this section
	if ( msg.text == "about" ) then
		if ( msg.from.username == "Mouamle" ) then
			R = get_receiver(msg)
			send_large_msg ( R , "Made by @Mouamle" );
		end
	end 

end



return {
	patterns = {
		"(.*)"		
  	},
  	run = run
} 


end